import { WeedSvg } from '../../WeedSvg.js';

export const Homework32  = () => `
<h2>ДОМАШЕКА #32</h2>

<h3>
  <p>СМОТРИМ СЛАЙДЫ УРОК №32 &mdash; <a href="/#/slides/lesson32">ССЫЛКЕ</a>
</h3>

<p>И пропустившие, и те кто был смотрим еще раз что мы изменили в игре - там 4 комита - все 4 смотрим код. Ссылки в слайдах.</p>

<h3>
  Катакомбі )
</h3>
<p><a href="http://napaleon.space/#/katakombi">http://napaleon.space/#/katakombi</a> - пока там 3 зоданея. Будет больше)
</p>

<h3>
  Дивимось дімона Код для Health Bar 
</h3>
<p>
  <a href="https://github.com/DarthVanger/ghost-of-kyiv/pull/5/files">Код Дивитись Тута</a>
</p>
<p>
  Кожен Лишаємо Мінімум Один Коментар до Дімона Коду!!!
</p>
<p>
  Якщо все зрозуміло, все влаштовує, згоден що ми вносимо даний код в <code>master</code> гілку &mdash; лишаємо комент "LGTM" &mdash; Looks Good To Me &mdash; типу "як на мене все ок".
</p>
<p>
  Якщо щось незрозуміло - питаємо коментарем на Гітхабі.
</p>
<p>
  Дімон захоче відповість там же, захоче на уроці. 
</p>
<p>
  Просто список питань у нас буде
</p>
<h4>Як запустити Дімона версію Гри (щоб побачити Health Bar вживу)</h4>
<ol>
  <li>
    Відкрити у VsCode ТЕЧКУ ghost-of-kyiv
  </li>
  <li>
    Відкрити там Bash термінал
  </li>
  <li>
    Прописати <code>git fetch</code><br/>
    Ця команда підтягує інфу про нові зміни, зокрема про гілку Дімона
  </li>
  <li>
    Переконайтеся що у вас нема змін (<code>git status</code> має бути clean). Якщо є зміни пишем <code>git stash</code> щоб їх зберегти в сундучок.
  </li>
  <li>
    Переходимо на Дімона гілку, для цього пишемо <code>git checkout dimoncheek</code>
  </li>
  <li>
    Все! :) Якщо не було помилок при виконанні гіт команд (вчитайся що гіт тобі пише блять)), у тебе в VSCode вже має бути Дімона код. Глянь в <code>app.js</code>
  </li>
  <li>
    Запускаєм Гру, дивимось як виглядає Health Bar Дімона, як працює.
  </li>
  <li>
    Погралися і переходьте відразу назад на гілку <code>master</code>, поки не забули. Пишіть в терміналі <code>git checkout master</code>. Інакше через пару днів відкриєте гру, а у вас не <code>master</code>, а гілка Дімона) І будете тупити шо не так))
  </li>
`;
