export const Homework51 = () => `
  <h2>ДОМАШЕКА #51</h2>    

  <h3>Намалювати хуйчек через канвас</h3>
  <p>намалювати хуйчек (або будь-яку іншу фігуру) через канвас</p>

  <h3>Use API на вибір</h3>

  <h4>Опція №1: Зробити повний клон фейсбука</h4>
  <p>
    <ul>
      <li>відображення стіни користувача</li>
      <li>можливісти запостити</li>
      <li>видаленяя поста</li>
      <li>список друзів</li>
    </ul>

    Сайт інтегрувати із фейсбук АПІ <b>самостійно</b>
  </p>

  <h4> Опція №2: Github API</h4>
  <p>
    За допомогою гітхаб АПІ
    <ul>
      <li> показати коміти користувача (списком в хтмл)</li>
      <li> показати список публічних репозиторіїв</li>
      <li> показати загальну кількість зірок у користувача</li>
    </ul>
  </p>
  <h4> Опція №3: API для кожного</h4>
  <p>
    будь яке апі на ваш вибір заюзати)
    зробити 3 різних запити, відобразити шось на екрані
  </p>
`;
