import { Lety4ka } from './Lety4ka.js';
import { Lesson } from './Lesson.js';

const html = `
  <h1>Lesson #36</h1>
  <article>
    <p>Ну здравствуй, Вангер!</p>
    <p>Сегодня тебе предстоит сложная задача...</p>
    <p>Ты должен создать новый Мир...</p>
    <p>Тот самый Первичный Суп Частиц... Из которого проистекает вся Материя...</p>
    <p>Но Тебе, Вангер, это, конечно ни к чему, что я тебя утомляю!</p>
    <p>Твои мысли лишь о Мехосах, об их моторах да удобных креслах...</p>
    <p>И том как подзаработать на Нюху и содержание Мехоса!</p>
    <p>Удел Вангеров создавать Интернет-Магазины для продажи Флегмы да Нимбосов... И то по шаблону клепают, у самих движок написать уменок-то не хватает!</p>
    <p>Дак к чему это я, ах да... Поэтому ты будешь создавать Мир в виде Интернет-Сайта...</p>
    <p>Пораскинь своими заржавевшими Вангеровскими извилинами, с чего мы начинаем создание Сайта?</p>
  </article>
`;

export const Lesson36 = (props) => Lesson({ html, ...props });
