
`
  Довай задодим Частицам случайные позиции... <code>let x = Math.random() * screen.width;</code>, и для <code>let y = Math.random() * screen.height;</code>. Эти переменные используй в хтмле... <code>... = \`&lt;div style="position: absolute; left: \${x}px; top: \${y}px;"&gt;.&lt;/div&gt;\`</code>
    `,
    `
        Мир обретает Форму... Хаоса... Космоса... Стали частицы в рандомные позиции на экране, Вангер?
    `,
    `
      Чего не хватает в нашем Мире, Вангер, поразкинь мозжечком, а?
    `,
    `
      Смышленый ты, Вангерок! Кончено, Движения, Времени. Наш Мир замер в одной позиции...
        Частицам нужно Движение, а Движению нужно Время...
    `,
  ];
const paragraphs = [
  `
    Ну здравствуй, Вангер!
    Сегодня тебе предстоит сложная задача...
    Ты должен Создать Новый Мир...
  `,
  `
    Но все Новое - Хорошо забытое старое, не так ли?
  `,
  `
    Твои Предки, Вангер... Люди... Однажды имели свою Цивилизацию...
  `,
  `
    Их образ мышления в Твоих, Вангер, Генах... 
  `,
  `
    Твоя задача соорудить что-то нечто того Мира... Ихнего...
  `,
  `
    Про Солнечную Систему слыхал-то?
  `,
  `
    Отлично, с нее и Начнем!...
  `,
  `
    Твои предки оставили книги: Кеплер, Ньютон, слыхал о таких ты, Вангер?..
  `,
  `
    Полистай, да сооруди нам Солнечную Систему...
  `,
  `
    Но для Начала Создай Время. <code>setTimeout(time, 1000)</code>
  `,
  `
    <code>function time() { console.log('tik tok') }</code>
  `
];

export const Chapter3 = {
  paragraphs,
}
